Reports/РасходыБудущихПериодовПроведенныеВРасчетномПериоде.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>РасходыБудущихПериодовПроведенныеВРасчетномПериоде</Name>
		</Properties>
	</Report>
</MetaDataObject>

CalculationRegisters/Начисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<CalculationRegister>
		<Properties>
			<Name>Начисления</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>true</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<Schedule>InformationRegister.ДанныеПроизводственногоКалендаря</Schedule>
			<ScheduleValue>InformationRegister.ДанныеПроизводственногоКалендаря.Resource.ЗначениеДней</ScheduleValue>
			<ScheduleDate>InformationRegister.ДанныеПроизводственногоКалендаря.Dimension.Дата</ScheduleDate>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.ВидыНачислений</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтработаноДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтработаноЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаЗатрат</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатратИДоходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтложенноеОтражение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

Reports/РасходыБудущихПериодовПроведенныеВРасчетномПериоде/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации()
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       см. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); // Отчет поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	МодульВариантыОтчетов = ОбщегоНазначения.ОбщийМодуль("ВариантыОтчетов");
	МодульВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина);
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "");
	НастройкиВарианта.Описание = НСтр("ru = 'Расходы будущих периодов, проведенные в расчетном периоде.'");

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Процедура формирования отчета.
//
// Параметры:
// ПараметрыОтчета - структура - набор параметров, необходимых для построения отчета.
// 	АдресХранилища - адрес временного хранилища.
Процедура Сформировать(СтруктураПараметров, АдресХранилища) Экспорт
	
	РезультатФормирования = Новый Структура("Результат, ОписаниеОшибки", Неопределено, "");
	СформироватьТабличныйДокумент(СтруктураПараметров, РезультатФормирования);
	ПоместитьВоВременноеХранилище(РезультатФормирования, АдресХранилища);
	
КонецПроцедуры

// Процедура - Сформировать табличный документ
//
// Параметры:
//  СтруктураПараметров	 - Структура - Параметры формирования отчета.
//  РезультатФормирования	 	- Структура - 
//
Процедура СформироватьТабличныйДокумент(СтруктураПараметров, РезультатФормирования)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ЧерноБелаяПечать = Истина;
	ТабличныйДокумент.ПолеСлева = 20;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	Организация = СтруктураПараметров.Организация;
	НачалоПериода = НачалоДня(СтруктураПараметров.НачалоПериода);
	КонецПериода = КонецДня(СтруктураПараметров.КонецПериода);
	
	Макет = ПолучитьМакет("ПФ_MXL_РасходыБудущихПериодов");

	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.ПериодПредставление = ПредставлениеПериода(НачалоПериода, КонецПериода);
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	Запрос = Новый Запрос;
	ТекстЗапроса =		
	"ВЫБРАТЬ
	|	Начисления1.ФизЛицо КАК Сотрудник,
	|	Начисления1.ФизЛицо.Код КАК ТабельныйНомер,
	|	СУММА(Начисления1.Результат) КАК Сумма1,
	|	Начисления1.Регистратор КАК Документ1
	|ПОМЕСТИТЬ ВременнаяТаблицаМесяц1
	|ИЗ
	|	РегистрРасчета.Начисления КАК Начисления1
	|ГДЕ
	|	Начисления1.ПериодРегистрации = &ПериодРегистрации1
	|	И Начисления1.Результат <> 0
	|	И Начисления1.Регистратор.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	Начисления1.ФизЛицо,
	|	Начисления1.Регистратор,
	|	Начисления1.ФизЛицо.Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Начисления2.ФизЛицо КАК Сотрудник,
	|	Начисления2.ФизЛицо.Код КАК ТабельныйНомер,
	|	СУММА(Начисления2.Результат) КАК Сумма2,
	|	Начисления2.Регистратор КАК Документ2
	|ПОМЕСТИТЬ ВременнаяТаблицаМесяц2
	|ИЗ
	|	РегистрРасчета.Начисления КАК Начисления2
	|ГДЕ
	|	Начисления2.ПериодРегистрации = &ПериодРегистрации2
	|	И Начисления2.Результат <> 0
	|	И Начисления2.Регистратор.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	Начисления2.ФизЛицо,
	|	Начисления2.Регистратор,
	|	Начисления2.ФизЛицо.Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВременнаяТаблицаМесяц1.Сотрудник, ВременнаяТаблицаМесяц2.Сотрудник) КАК Сотрудник,
	|	ЕСТЬNULL(ВременнаяТаблицаМесяц1.ТабельныйНомер, ВременнаяТаблицаМесяц2.ТабельныйНомер) КАК ТабельныйНомер,
	|	ВременнаяТаблицаМесяц1.Сумма1,
	|	ВременнаяТаблицаМесяц1.Документ1,
	|	ВременнаяТаблицаМесяц2.Сумма2,
	|	ВременнаяТаблицаМесяц2.Документ2,
	|	ЕСТЬNULL(ВременнаяТаблицаМесяц1.Сумма1, 0) + ЕСТЬNULL(ВременнаяТаблицаМесяц2.Сумма2, 0) КАК Итого
	|ИЗ
	|	ВременнаяТаблицаМесяц1 КАК ВременнаяТаблицаМесяц1
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВременнаяТаблицаМесяц2 КАК ВременнаяТаблицаМесяц2
	|		ПО ВременнаяТаблицаМесяц1.Сотрудник = ВременнаяТаблицаМесяц2.Сотрудник
	|ГДЕ
	|	ЕСТЬNULL(ВременнаяТаблицаМесяц1.Сумма1, 0) + ЕСТЬNULL(ВременнаяТаблицаМесяц2.Сумма2, 0) <> 0
	|ИТОГИ ПО
	|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("НачалоПериода",	НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",	КонецПериода);
	Запрос.УстановитьПараметр("ПериодРегистрации1",	ДобавитьМесяц(НачалоПериода, 1));
	Запрос.УстановитьПараметр("ПериодРегистрации2",	ДобавитьМесяц(НачалоПериода, 2));

	Если ЗначениеЗаполнено(Организация) Тогда
		Запрос.УстановитьПараметр("Организация", Организация);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Организация = &Организация", "Истина");
	КонецЕсли;		
	
	Запрос.Текст = ТекстЗапроса;
	ВыборкаОбщая = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	
	ОбластьШапкаТаблицы	= Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьШапкаТаблицы.Параметры.МесяцПлюс1  = ПредставлениеПериода(ДобавитьМесяц(НачалоПериода, 1), КонецМесяца(ДобавитьМесяц(НачалоПериода, 1)));
	ОбластьШапкаТаблицы.Параметры.МесяцПлюс2  = ПредставлениеПериода(ДобавитьМесяц(НачалоПериода, 2), КонецМесяца(ДобавитьМесяц(НачалоПериода, 2)));
    ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);	
	
	Пока ВыборкаОбщая.Следующий() Цикл		
		ВыборкаСтрока = ВыборкаОбщая.Выбрать();
		Пока ВыборкаСтрока.Следующий() Цикл
			ОбластьСтрока	= Макет.ПолучитьОбласть("Строка");
			ОбластьСтрока.Параметры.Заполнить(ВыборкаСтрока);
		    ТабличныйДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;												
		ИтогОбщий	= Макет.ПолучитьОбласть("ИтогоПоПредприятию");
		ИтогОбщий.Параметры.Заполнить(ВыборкаОбщая);
		ТабличныйДокумент.Вывести(ИтогОбщий);		
	КонецЦикла;	
		
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	РезультатФормирования.Результат = ТабличныйДокумент;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
